day1/load_testing/logs/sync_sleep_0/puma/siege_test_case_01.log
** SIEGE 4.1.7
** Preparing 30 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		    96063    hits
Availability:		      100.00 %
Elapsed time:		       10.83 secs
Data transferred:	        4.58 MB
Response time:		        3.35 ms
Transaction rate:	     8870.08 trans/sec
Throughput:		        0.42 MB/sec
Concurrency:		       29.75
Successful transactions:    96063
Failed transactions:	        0
Longest transaction:	       80.00 ms
Shortest transaction:	        0.00 ms
 
 ==> GET  /sync_sleep/0
** SIEGE 4.1.7
** Preparing 40 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		    90151    hits
Availability:		      100.00 %
Elapsed time:		       10.97 secs
Data transferred:	        4.30 MB
Response time:		        4.83 ms
Transaction rate:	     8217.96 trans/sec
Throughput:		        0.39 MB/sec
Concurrency:		       39.71
Successful transactions:    90151
Failed transactions:	        0
Longest transaction:	      150.00 ms
Shortest transaction:	        0.00 ms
 
** SIEGE 4.1.7
** Preparing 50 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		    89820    hits
Availability:		      100.00 %
Elapsed time:		       10.90 secs
Data transferred:	        4.28 MB
Response time:		        6.04 ms
Transaction rate:	     8240.37 trans/sec
Throughput:		        0.39 MB/sec
Concurrency:		       49.80
Successful transactions:    89820
Failed transactions:	        0
Longest transaction:	      130.00 ms
Shortest transaction:	        0.00 ms
 
sleep/0